# SetCutLinePatternId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetCutLinePatternId Method
OverrideGraphicSettings Class See Also
---
Sets the ElementId of the cut surface line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings SetCutLinePatternId(
	ElementId linePatternId
)
```

Visual Basic
---
```text
Public Function SetCutLinePatternId ( _
	linePatternId As ElementId _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetCutLinePatternId(
	ElementId^ linePatternId
)
```

# ### Parameters
linePatternId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the cut surface line pattern for the override. InvalidElementId means no override is set.
# ### Return Value
Reference to the changed object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace